{
  "file_title": "daśasāhasrikā-prajñāpāramitā1-and-2-translated-from-tibetan",
  "file_title_normal": "dasasahasrika-prajnaparamita1-and-2-translated-from-tibetan",
  "metadata": {
    "original_title": "Daśasāhasrikā prajñāpāramitā, 1 and 2 translated from Tibetan",
    "contributors": [
      {
        "role": "data entry",
        "name": "Klaus Wille",
        "when": ""
      },
      {
        "role": "contribution to GRETIL",
        "name": "Klaus Wille",
        "when": ""
      },
      {
        "role": "initial normalization and conversion to legacy GRETIL formats",
        "name": "Reinhold Grünendahl",
        "when": ""
      },
      {
        "role": "normalization and conversion to TEI-conformant markup",
        "name": "Maximilian Mehner",
        "when": ""
      }
    ],
    "publisher": "Göttingen Register of Electronic Texts in Indian Languages (GRETIL), SUB Göttingen",
    "license": {
      "text": "Distributed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.",
      "target": "https://creativecommons.org/licenses/by-nc-sa/4.0/"
    },
    "publication_date": "2020-07-31",
    "source": "Sten Konow: The Two First Chapters of the Daśasāhasrikā Prajñāpāramitā. Restoration of the Sanskrit Text, Analysis and Index. Oslo : 1941 (Avhandlinger utgitt av det Norske Videnskaps-Akademi i Oslo II. Hist.-Filos. klasse 1941, no.1)."
  },
  "body": [
    {
      "tag": "p",
      "attributes": {},
      "text": "Daśasāhasrikā Prajñāpāramitā"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evaṃ mayā śrutam: ekasmin samaye bhagavān rājagṛhe viharati sma gṛdhrakūṭaparvate mahatā bhikṣusaṃghena sārdham anekair bhikṣusahasraiḥ, sarvair arhadbhiḥ kṣīṇāsravair niṣkleśair vaśībhūtaiḥ suvimuktacittaiḥ suvimuktaprajñair ājāneyair mahānāgaiḥ kṛtakṛtyaiḥ kṛtakaraṇīyair apahṛtabhārair anuprāptasvakārthaiḥ parikṣīṇabhavasaṃyojanaiḥ samyagājñāsuvimuktacittaiḥ sarvacetovaśiparamapāramitāprāptair, ekaṃ pudgalaṃ sthāpayitvā yadutāyuṣmantam ānandaṃ śaikṣaṃ srotaāpannaṃ; pañcamātraiś ca bhikṣuṇīśatair, upāsakair upāsikābhiś ca sārdhaṃ, sarvair dṛṣṭasatyair; anekasahasraiś ca bodhisattvair mahāsattvaiḥ sārdhaṃ, sarvair dhāraṇīpratilabdhaiḥ samādhipratilabdhaiḥ śūnyatāvihāribhir animittagocarair avikalpitapraṇidhānaiḥ samatākṣāntipratilabdhair asaṃgapratibhāṇapratilabdhaiḥ sarvaiś ca pañcābhijñair ādeyavacanair akuhakair apagatajñānārthalābhasatkāracittair nirāmiṣadharmadeśakair gambhīradharmakṣāntipāragatair vaiśāradyaprāptair mārakarmasamatikrāntaiḥ sarvakaraṇāvaraṇavimuktair dharmanirdeśasaṃcitair asaṃkhyeyakalpasamārabdhapraṇidhānaiḥ smitamukhaiḥ pūrvābhilāpibhir vyapagatabhrūkuṭīmukhair anantapariṣadabhibhavanavaiśāradyasamanvāgatair anekakalpakoṭinirdeśaniḥsaraṇakuśalair māyāmarīcisvapnodakacandrapratibhāsākāśagandharvanagarapratibimbanirmāṇopamadharmādhimuktair apramāṇavaiśāradyasamanvāgataiḥ sarvasattvacittagatyadhimuktiparyāptikuśalaiḥ sarvasattvāpratihatacittair mahākṣāntisamanvāgatair yāthātmyāvatāraṇakuśalair anantabuddhakṣetravyūhaparigṛhītair asaṃkhyeyalokadhātugatabuddhānusmṛtisamādhisatatasamitābhimukhībhūtair aparimitabuddhādhyeṣaṇakuśalair nānādṛṣṭisamutthitakleśapraśamanakuśalaiḥ samādhivikrīḍanaśatasahasranirhārakuśalais, tadyathā bhadrapālena ca bodhisattvena mahāsattvena, ratnākareṇa ca, sārthavāhena ca, naradattena ca, varuṇadattena ca, indradattena ca, udāramatinā ca, viśeṣamatinā ca, vardhamānamatinā ca, amoghadarśinā ca, susaṃprasthitena cam, suvikrāntavikramiṇā ca, nityodyuktena ca, anikṣiptadhureṇa ca, ādityagarbheṇa ca, candragarbheṇa ca, anupamamatinā ca, avalokiteśvareṇa ca, mañjuśriyā ca, ratnamudrāhastena ca, nityotkṣiptahastena ca bodhisattvena, maitreyeṇa ca bodhisattvena mahāsattvena, evaṃpramukhair anekabodhisattvasahasraiḥ, sarvaiḥ kumārabhūtaiḥ sārdham."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tasyāṃ velāyāṃ bhagavān śakraṃ ca brahmāṇaṃ ca sarvāṃś ca lokapālān tejasābhibhūya tāsāṃ catasṛnāṃ parṣadāṃ purato virocamāna ṛddhyā nānāvidhaṃ vikurvaṇaprātihāryaṃ saṃdarśayati sma. romakūpebhyo 'nekāni raśmikoṭiniyutaśatasahasrāṇi niśceruḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tena khalu samayenāyuṣmān śāradvatīputras tasyāṃ parṣadi saṃnipatito 'bhūt saṃniṣaṇṇaḥ. sa tathāgatasyedṛśam ṛddhivikurvaṇaprātihāryaṃ dṛṣṭvā tuṣṭa udagra āttamanaḥ pramuditaḥ prītisaumanasyajāta utthāyāsanād ekāṃsam uttarāsaṃgaṃ kṛtvā dakṣiṇaṃ jānumaṇḍalaṃ pṛthivyāṃ pratiṣṭhāpya yena bhagavāṃs tenāñjaliṃ praṇamya bhagavantam etad avocat: sacen me bhagavān praśnavyākaraṇāyāvakāśaṃ kuryād ahaṃ bhagavantam kaṃcit pradeśaṃ prakṣyāmi."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evam ukte bhagavān āyuṣmantaṃ śāradvatīputram etad avocat: tathāgataṃ praṣṭuṃ, śāradvatīputra, sadā kṛtāvakāśatvād yat kiṃcit tvaṃ tathāgataṃ praṣṭum icchasi, tat prccha, praśnaprativacanena cāhaṃ tava cittam ārādhayiṣye."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evam ukta āyuṣmān śāradvatīputro bhagavantam etad avocat: prajñāpāramitā, bhadanta bhagavan, prajñāpāramitety ucyate; katamā bhadanta bhagavan sā bodhisattvānaṃ prajñāpāramitā? kasya dharmasya pāramitāyāṃ bodhisattvāḥ prajñāpāramitāyāṃ pāraṃ gatāḥ kṣipram anuttarāṃ samyaksaṃbodhim abhisaṃbudhyante?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evam ukte bhagavān āyuṣmate śāradvatīputrāya sādhukāram adāt: sādhu, sādhu, śāradvatīputra, yat tvaṃ tathāgatasyādhiṣṭhānād evaṃ praśnaṃ pṛcchasi, sādhu; sundaras te saṃkalpaḥ, tena hi tvaṃ śṛṇu, sādhu ca suṣṭhu ca manasi kuru, bhāṣiṣye 'haṃ prajñāpāramitām."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evam astu bhadanta bhagavann ity āyuṣmān śāradvatīputro bhagavataḥ pratyaśroṣīt."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavāṃs tasyaitad avocat: śāradvatīputra prajñāpāramitā prajñāpāramitety ucyate yad idaṃ sarvadharmānabhiniveśaḥ. anabhiniviṣṭāḥ śāradvatīputra bodhisattvāḥ prajñāpāramitāyāṃ pāraṃ gatāḥ kṣipram anuttarāṃ samyaksaṃbodhim abhisaṃbudhyante."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "āha: katame bhadanta bhagavaṃs te sarvadharmā yeṣu bodhisattvā mahāsattvā anabhiniviṣṭāḥ?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān āha: sarvadharmāḥ śāradvatīputrocyante yaduta pañca skandhā, dvādaśāyatanāny, aṣṭādaśa dhātavaś, catvāry āryasatyāni, dvādaśa pratītyasamutpādāṅgāni, catvāri smṛtyupasthānāni, catvāri samyakprahāṇāṇi, catvāra ṛddhipādāḥ, pañcendriyāṇi, pañca balāni, sapta bodhyaṅgāny, āryāṣṭāṅgamārgaḥ, śūnyatāvimokṣamukham, animittavimokṣamukham, apraṇihitavimokṣamukhaṃ, catvāri dhyānāni, catvāry apramānāni, catasra ārūpyasamāpattayo, 'sṭau vimokṣā, daśānupūrvavihārasamāpattayo, nava saṃjñā, daśānusmṛtayaḥ, ṣaṭ saṃjñākārā, dharmajñānam, anvayajñānaṃ, paracittajñānani, saṃvṛtijñānaṃ, duḥkhajñānaṃ, samudayajñānaṃ, nirodhajñānaṃ, mārgajñānaṃ, kṣayajñānam, anutpādajñānaṃ, yathābhūtajñānaṃ ca; evam eva savitarkaḥ savicāraḥ samādhir, avitarko vicāramātraḥ samādhir, avitarkāvicāraḥ samādhir, anājñātamājñāsyāmīndriyam, ājñendriyam, ājñātāvīndriyam, aṣṭāv abhibhvāyatanāni, daśa kṛtsnāyatanāny, aṣṭādaśa śūnyatā, daśa tathāgatabalāni, catvāri vaiśāradyāni, catasraḥ pratisaṃvido, mahāmaitrī, mahākaruṇā, aṣṭādaśāveṇikā buddhadharmāś ca; evam eva sarvajñatā, mārgākārajñatā, sarvākārajñatā, ṣaṭ pāramitāḥ, pañcābhijñāḥ, pañca cakṣūṃṣi, dvātriṃśan mahāpuruṣalakṣaṇāny, aśītir anuvyañjānāni ca. ete te sarvadharmā yeṣv anabhiniviṣṭā bodhisattvā mahāsattvāḥ prajñāpāramitāyāṃ pāraṃ gatāḥ kṣipram anuttarāṃ samyaksaṃbodhim abhisaṃbudhyante."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tata āyuṣmān śāradvatīputro bhagavantam etad avocat: katame bhadanta bhagavan pañca skandhāḥ, peyālaṃ yāvat katamāni dvādaśa pratītyasamutpādāṅgāni, katamāni catvāri smṛtyupasthānāni, peyālaṃ yāvat katama āryāṣṭāṅgamārgaḥ, katamaṃ śūnyatāvimokṣamukhaṃ, peyālaṃ yāvat sarvākārajñatā, katamāḥ ṣaṭ pāramitāḥ, peyālaṃ yāvad aśītir anuvyañjanāni?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_1] evam ukte bhagavān āyuṣmantaṃ śāradvatīputram etad avocat: pañca skandhā iti, śāradvatīputra, ucyante yaduta rūpaṃ, vedanā, saṃjñā, saṃskārā, vijñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_2] tatra katamāni dvādaśāyatanāni? ṣaḍ ādhyātmikāni, ṣaḍ bāhyāni. etāny ucyante dvādaśāyatanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamāni ṣaḍ ādhyātmikāny āyatanāni? yaduta cakṣurāyatanaṃ, śrotrāyatanaṃ, ghrāṇāyatanaṃ, jihvāyatanaṃ, kāyāyatanaṃ, manaāyatanam. etāny ucyante ṣaḍ ādhyātmikāny āyatanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamāni ṣaḍ bāhyāny āyatanāni? yaduta rūpāyatanaṃ, śabdāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, spraṣṭavyāyatanaṃ, dharmāyatanam. etāny ucyante ṣaḍ bāhyāny āyatanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_3] tatra katama aṣṭādaśa dhātavaḥ? yaduta cakṣurdhātū, rūpadhātuś, cakṣurvījñānadhātuḥ; śrotradhātuḥ, śabdadhātuḥ, śrotravijñānadhātuḥ; ghrānadhātur, gandhadhātur, ghrāṇavijñānadhātuḥ; jihvādhātū, rasadhātur, jihvāvijñānadhātuḥ; kāyadhātuḥ, spraṣṭavyadhātuḥ, kāyavijñānadhātuḥ; manodhātur, dharmadhātur, manovijñānadhātuḥ. eta ucyanta aṣṭādaśa dhātavaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_4] tatra katamāni catvāry āryasatyāni? yaduta duḥkham āryasatyaṃ, samudaya āryasatyaṃ, nirodha āryasatyaṃ, mārga āryasatyam. etāny ucyante catvāry āryasatyāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_5] tatra katamāni dvādaśa pratītyasamutpādāṅgāni? yadutāvidyāpratyayāḥ saṃskārāḥ, saṃskārapratyayaṃ vijñānaṃ, vijñānapratyayaṃ nāmarūpaṃ, nāmarūpapratyayāni ṣaḍ āyatanāni, ṣaḍāyatanapratyayaḥ sparśaḥ, sparśapratyayā vedanā, vedanāpratyayā tṛṣṇā, tṛṣṇāpratyayam upādānam, upādānapratyayo bhavo, bhavapratyayā jātir, jātipratyayā jarāmaraṇaśokaparidevaduḥkhadaurmanasyopayāsāḥ. evam asya kevalasya mahato duḥkhaskandhasya samudayo bhavati."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "avidyānirodhāt saṃskāranirodhaḥ, saṃskāranirodhād vijñānanirodho, vijñānanirodhān nāmarūpanirodho, nāmarūpanirodhāt ṣaḍāyatananirodhaḥ, ṣaḍāyatananirodhāt sparśanirodhaḥ, sparśanirodhād vedanānirodho, vedanānirodhāt tṛṣṇānirodhas, tṛṣṇānirodhād upādānanirodha, upādānanirodhād bhavanirodho, bhavanirodhāj jātinirodho, jātinirodhāj jarāmaraṇaśokaparidevaduḥkhadaurmanasyopayāsanirodhaḥ. evam asya kevalasya duḥkhaskandhasya nirodho bhavati. eṣa ucyate pratītyasamutpādo 'nulomaś ca pratilomaś ca."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_6] tatra katamāni catvāri smṛtyupasthānāni? yaduta kāye kāyānupaśyanāsmṛtyupasthānaṃ, vedanāsu vedanānupaśyanāsmṛtyupasthānaṃ, citte cittānupaśyanāsmṛtyupasthānaṃ, dharmeṣu dharmānupaśyanāsmṛtyupasthānam. etāny ucyante catvāri smṛtyupasthānāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_7] tatra katamāni catvāri samyakprahāṇāni? iha bodhisattvo mahāsattvo 'nutpannānāṃ pāpakānām akuśalānāṃ dharmāṇām anutpādāya chandaṃ janayati vyāyacchate vīryam ārabhati cittaṃ pragrhṇāti samyak pradadhāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "utpannānāṃ pāpakānām akuśalānāṃ dharmāṇāṃ prahāṇāya chandaṃ janayati vyāyacchate vīryam ārabhati cittaṃ pragṛhṇāti samyak pradadhāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "anutpannānāṃ kuśalānāṃ dharmāṇām utpādāya chandaṃ janayati vyāyacchate vīryam ārabhati cittaṃ pragṛhṇāti samyak pradadhāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "utpannānāṃ kuśalānāṃ dharmāṇāṃ sthitaye 'saṃpramoṣāya bhūyobhāvanāyai paripūraṇāya chandaṃ janayati vyāyacchate vīryam ārabhati cittaṃ pragṛhṇāti samyak pradadhāti. etāny ucyante catvāri samyakprahāṇāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_8] tatra katame catvāra ṛddhipādāh? yaduta chandasamādhiprahāṇasaṃskārasamanvāgata ṛddhipādo, vīryasamādhiprahāṇasaṃskārasamanvāgata ṛddhipādaś, cittasamādhiprahāṇasaṃskārasamanvāgata ṛddhīpādo, mīmāṃsāsamādhiprahāṇasaṃskārasamanvāgata ṛddhipādaḥ. eta ucyante catvāra ṛddhipādāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_9] tatra katamāni pañcendriyāṇi? śraddhendriyaṃ, vīryendriyaṃ, smṛtīndriyaṃ, samādhīndriyaṃ, prajñendriyam. etāny ucyante pañcendriyāṇi."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_10] tatra katamāni pañca balāni? śraddhābalaṃ, vīryabalaṃ, smṛtibalaṃ, samādhibalaṃ, prajñābalam. etāny ucyante pañca balāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_11] tatra katamāni sapta bodhyaṅgāni? yaduta smṛtisaṃbodhyaṅgaṃ, dharmapravicayasaṃbodhyaṅgaṃ, vīryasaṃbodhyaṅgaṃ, prītisaṃbodhyaṅgaṃ, prasrabdhisaṃbodhyaṅgaṃ, samādhisaṃbodhyaṅgam, upekṣāsaṃbodhyaṅgam. etāny ucyante sapta bodhyaṅgāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_12] tatra katama āryāṣṭāṅgamārgaḥ? yaduta samyagdṛṣṭiḥ, samyaksaṃkalpaḥ, samyagvāk, samyakkarmāntaḥ, samyagājīvaḥ, samyagvyāyāmaḥ, samyaksmṛtiḥ, samyaksamādhiḥ. eṣa ucyata āryāṣṭāngamārgaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_13] tatra katamac chūnyatāvimokṣamukham? yaduta sarvadharmasvalakṣaṇatāśūnyapratyavekṣaṇacittasthitir vimokṣamukham. etad ucyate śūnyatāvimokṣamukham."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_14] tatra katamad animittaṃ vimokṣamukham? yaduta sarvadharmasvalakṣaṇatānimittapratyavekṣaṇacittasthitir animittavimokṣamukham. etad ucyate 'nimittaṃ vimokṣamukham."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_15] tatra katamad apraṇihitaṃ vimokṣamukham? yaduta sarvadharmānabhisaṃskāre 'nabhisaṃskāracittasthitir apraṇihitavimokṣamukham. etad ucyate 'praṇihitaṃ vimokṣamukham."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_16] tatra katamāni catvāri dhyānāni? yaduta viviktaṃ kāmair viviktaṃ pāpakair akuśalair dharmaiḥ savitarkaṃ savicāraṃ vivekajaṃ prītisukhaṃ prathamaṃ dhyānam upasaṃpadya viharati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa vitarkavicārāṇām upaśamād adhyātmaṃ saṃprasādāc cetasa ekotībhāvad avitarkam avicāraṃ samādhijaṃ prītisukhaṃ dvitīyaṃ dhyānam upasaṃpadya viharati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa prīter virāgād upekṣako viharati smṛtimān saṃprajānan, sukhaṃ ca kāyena pratisaṃvedayati yat tad āryā ācakṣate smṛtimān sukhī sukhavihāry upekṣaka iti, niṣprītikaṃ tṛtīyaṃ dhyānam upasaṃpadya viharati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sukhasya ca prahāṇād duḥkhasya ca prahāṇāt pūrvam eva saumanasyadaurmanasyayor astaṃgamād aduḥkhāsukham upekṣāsmṛtipariśuddhaṃ caturthaṃ dhyānam upasaṃpadya viharati. etāny ucyante catvāri dhyānāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_17] tatra katamāni catvāry apramāṇāni? yaduta maitrī, karuṇā, muditā, upekṣā. etāny ucyante catvāry apramāṇāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_18] tatra katamāś catasra ārūpyasamāpattayaḥ? yadutākāśānantyāyatanaṃ, vijñānānantyāyatanam, ākiñcanyāyatanaṃ, naivasaṃjñānāsaṃjñāyatanam. etā ucyante catasra ārūpyasamāpattayaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_19] tatra katame 'ṣṭau vimokṣāḥ? yaduta rūpī rūpāṇi pasyaty, ayaṃ prathamo vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyaty, ayaṃ dvitīyo vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "śubham ity evādhimukto bhavaty, ayaṃ trtīyo vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo rūpasaṃjñānāṃ samatikramāt pratighasaṃjñānām astaṃgamān nānātvasaṃjñānām amanasikārād anantam ākāśam ity ākāśānantyāyatanam upasaṃpadya viharaty, ayaṃ caturtho vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśa ākāśānantyāyatanaṃ samatikramyānantaṃ vijñānam iti vijñānānantyāyatanam upasaṃpadya viharaty, ayaṃ pañcamo vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo vijñānānantyātanaṃ samatikramya nāsti kiṃcid ity ākiñcanyāyatanam upasaṃpadya viharaty, ayaṃ ṣaṣṭho vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśa ākiñcanyāyatanaṃ samatikramya naivasaṃjñānāsaṃjñāyatanam upasaṃpadya viharaty,ayaṃ saptamo vimokṣaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo naivasaṃjñānāsaṃjñāyatanaṃ samatikramya saṃjñāvedayitanirodham upasaṃpadya viharaty, ayam aṣṭamo vimokṣaḥ. eta ucyante 'ṣṭau vimokṣāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_20] tatra katamā navānupūrvavihārasamāpattayaḥ? yaduta"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "viviktaṃ kāmair viviktaṃ pāpakair akuśalair dharmaiḥ savitarkaṃ savicāraṃ vivekajaṃ prītisukhaṃ prathamaṃ dhyānam upasaṃpadya viharatīyaṃ prathamā samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa vitarkavicārāṇām upaśamād adhyātmaṃ saṃprasādāc cetasa ekotībhāvād avitarkam avicāraṃ samādhijaṃ prītisukhaṃ dvitīyaṃ dhyānam upasaṃpadya viharatīyaṃ dvitīyā samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa prīter virāgād upekṣako viharati smṛtimān saṃprajānan sukhaṃ ca kāyena pratisaṃvedayati yat tad āryā ācakṣate smṛtimān sukhavihāry upekṣaka iti niṣprītikaṃ tṛtīyaṃ dhyānam upasaṃpadya viharatīyaṃ tṛtīyā samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sukhasya ca prahāṇād duḥkhasya ca prahāṇāt pūrvam eva saumanasyadaurmanasyayor astaṃgamād aduḥkhāsukham upeksāsmṛtipariśuddhaṃ caturthaṃ dhyānam upasaṃpadya viharatīyaṃ caturthī samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo rūpasaṃjñānāṃ samatikramāt pratighasaṃjñānām astaṃgamān nānātvasaṃjñānām amanasikārād anantam ākāśam ity ākāśānantyāyatanam upasaṃpadya viharatīyaṃ pañcamī samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśa ākāśānantyāyatanaṃ samatikramyānantaṃ vijñānam iti vijñānānantyāyatanam upasaṃpadya viharatīyaṃ ṣaṣṭhī samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo vijñānānantyāyatanaṃ samatikramya nāsti kiṃcid ity ākiñcanyāyatanam upasaṃpadya viharatīyaṃ saptamī samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśa ākiñcanyāyatanaṃ samatikramya naivasaṃjñānāsaṃjñāyatanam upasaṃpadya viharatīyam aṣṭamī samāpattiḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo naivasaṃjñānāsaṃjñāyatanaṃ samatikramya saṃjñāvedayitanirodham upasaṃpadya viharatīyaṃ navamī samāpattiḥ. etā ucyante navānupūrvasamāpattayaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_21] tatra katamā nava saṃjñāḥ? yaduta vidhmātakasaṃjñā, vipaḍumakasaṃjñā, vilohitakasaṃjñā, vipūyakasaṃjñā, vinīlakasaṃjñā, vikhāditakasaṃjñā, vikṣiptakasaṃjñā, asthikasaṃjñā, vidagdhakasaṃjñā. etā ucyante nava saṃjñāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_22] tatra katamā daśānusmṛtayaḥ? yaduta buddhānusmṛtir, dharmānusmṛtiḥ, saṃghānusmṛtiḥ, śīlānusmṛtis, tyāgānusmṛtir, devatānusmṛtir, upaśamānusmṛtir, ānāpānānusmṛtiḥ, kāyagatānusmṛtir, maraṇānusmṛtiḥ. etā ucyante daśānusmṛtayaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_23] tatra katame ṣaṭ saṃjñākārāḥ? yadutānityasaṃjñā, duḥkhasaṃjñā, anātmasaṃjñā, aśubhasaṃjñā, maraṇasaṃjñā, sarvaloke 'nabhiratisaṃjñā. eta ucyante ṣaṭ saṃjñākārāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_24] tatra katamad dharmajñānam? yat pañcānāṃ skandhānāṃ parikarmitatve paricchedajñānam idam ucyate dharmajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_25] tatra katamad anvayajñānam? yac chakṣur anityam iti jñānam, evam eva śrotraṃ, ghrāṇaṃ, jihvā, kāyo, mano, rūpaṃ, śabdo, gandho, rasaḥ, spraṣṭavyaṃ, dharmā anityā iti yaj jñānam idam ucyate 'nvayajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_26] tatra katamat paracittajñānam? yat parasattvānaṃ parapudgalānāṃ cetasaiva cetasi cetasikeṣu ca dharmeṣv avicikitsitaṃ jñānam idam ucyate paracittajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_27] tatra katamat saṃvṛtijñānam? yat pratipajjñānam idam ucyate saṃvṛtijñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_28] tatra katamad duḥkhajñānam? yad duḥkhasyotpādasthitijñānam idam ucyate duḥkhajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_29] tatra katamat samudayajñānam? yat samudayasya prahāṇajñānam idam ucyate samudayajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_30] tatra kataman nirodhajñanam? yad duḥkhanirodhajñānam idam ucyate nirodhajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_31] tatra kataman mārgajñānam? yad āryāṣṭāṅgamārgajñānam idam ucyate mārgajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_32] tatra katamat kṣayajñānam? yad rāgadveṣamohakṣayajñānam idam ucyate kṣayajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_33] tatra katamad anutpādajñānam? yad bhavagatyanutpadajñānam idam ucyate 'nutpādajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_34] tatra katamad yathābhūtajñānam? yat tathāgatasya sarvajñatājñānam idam ucyate yathābhūtajñānam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_35] tatra katamad anājñātamājñāsyāmīndriyam? yac chaikṣāṇāṃ pudgalānām anabhisamitānāṃ śraddhendriyaṃ, vīryendriyaṃ, smṛtīndriyaṃ, samādhīndriyaṃ, prajñendriyaṃ idam ucyate 'nājñātamājñāsyāmīndriyam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_36] tatra katamad ājñendriyam? yac chaikṣāṇāṃ pudgalānām abhisamitānāṃ śraddhendriyaṃ vīryendriyaṃ, smṛtīndriyaṃ, samādhīndriyaṃ, prajñendriyam idam ucyate ājñendriyam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_37] tatra katamad ājñātāvīndriyam? yad aśaikṣāṇāṃ pudgalānāṃ tadyathārhatāṃ, pratyekabuddhānāṃ, daśabhūmisthitānāṃ bodhisattvānāṃ, tathāgatānām arhatāṃ samyaksaṃbuddhānāṃ śraddhendriyaṃ, vīryendriyaṃ, smṛtīndriyaṃ, samādhīndriyaṃ prajñendriyam idam ucyata ājñātāvīndriyam."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_38] tatra katamaḥ savitarkaḥ savicāraḥ samādhiḥ? viviktaṃ kāmair viviktaṃ pāpakair akuśalair dharmaiḥ prītisukhaṃ prathamaṃ dhyānam upasaṃpadya viharaty ayam ucyate savitarkaḥ savicāraḥ samādhiḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_39] tatra katamo vitarko vicāramātraḥ samādhiḥ? yā prathamadhyānasya dvitīyadhyānasya cāntarikāyam ucyate 'vitarko vicāramātraḥ samādhiḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_40] tatra katamo 'vitarko 'vicāraḥ samādhiḥ? prathamaṃ dhyānam upādāya yāvan naivasaṃjñānāsaṃjñāyatanasamāpattir eṣa ucyate 'vitarko 'vicāraḥ samādhiḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_41] tatra katamāny aṣṭāv abhibhvāyatanāni? yadutādhyātmaṃ rūpasaṃjñī bahirdhā rūpāṇi paśyati parīttāni suvarṇadurvarṇāni, tāni rūpāṇy abhibhūya jānāty abhibhūya paśyaty, evaṃsaṃjñī bhavatīdaṃ prathamam abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati mahadgatāni suvarṇadurvarṇāni, tāni rūpaṇy abhibhūya jānāty abhibhūya paśyaty, evaṃsaṃjñī bhavatīdaṃ dvitīyam abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati nīlāni nīlavarṇāni nīlanidarśanāni nīlanirbhāsāni, tadyathomāpuṣpaṃ saṃpannaṃ vā bāraṇaseyaṃ vastraṃ nīlaṃ nīlavarṇaṃ nīlanidarśanaṃ nīlanirbhāsam, evam evādhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati nīlāni nīlavarṇāni nīlanidarśanāni nīlanirbhasānīdaṃ tṛtīyam abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati pītāni pītavarṇāni pītanidarśanāni pītanirbhāsāni, tadyathā karṇikārapuṣpaṃ saṃpannaṃ vā bārāṇaseyaṃ vastraṃ pītaṃ pītavarṇaṃ pītanidarśanaṃ pītanirbhāsam, evam evādhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati pītāni pītavarṇāni pītanidarśanāni pītanirbhāsānīdaṃ caturtham abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati lohitāni lohitavarṇāni lohitanidarśanāni lohitanirbhāsāni, tadyathā bandhujīvakapuṣpaṃ saṃpannaṃ vā bārāṇaseyaṃ vastraṃ lohitaṃ lohitavarṇaṃ lohitanidarśanaṃ lohitanirbhāsam, evam evādhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyati lohitāni lohitavarṇāni lohitanidarśanāni lohitanirbhāsānīdaṃ pañcamam abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "adhyātmam arūpasaṃjnī bahirdhā rūpāṇi paśyaty avadātāny avadātavarṇāny avadātanidarśanāny avadātanirbhāsāni, tadyathośanastārakayā varṇo 'vadāto 'vadātavarṇo 'vadātanidarśano 'vadātanirbhāsa, evam evādhyātmam arūpasaṃjñī bahirdhā rūpāṇi paśyaty avadātāny avadātavarṇāny avadātanidarśanāny avadātanirbhāsānīdaṃ ṣaṣṭham abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśo rūpasaṃjñānaṃ samatikramat pratighasaṃjñānām astaṃgamān nānātvasaṃjñānām amanasikārād anantam ākāśam ity ākāśānantyāyatanam upasaṃpadya viharatīdaṃ saptamam abhibhvāyatanam;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa sarvaśa ākāśānantyāyatanaṃ samatikramyānantaṃ vijñānam itī vijñānānantyāyatanam upasaṃpadya viharatīdam aṣṭamam abhibhvāyatanam. etāny ucyante 'ṣṭāv abhibhvāyatanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_42] tatra katamāni daśa kṛtsnāyatanāni? yaduta pṛthivīkṛtsnam, apkṛtsnaṃ, tejaḥkṛtsnaṃ, vāyukṛtsnam, ākāśakṛtsnaṃ, nīlakṛtsnaṃ, pītakṛtsnaṃ, lohitakṛtsnam, avadātakṛtsnaṃ, vijñānakṛtsnam. etāny ucyante daśa kṛtsnāyatanāni:"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn pṛthivīdhātāv adhimucya sarvam api pṛthivīdhātur evaikadhātur bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn abdhātāv adhimucya sarvam apy abdhātur evaikadhātur bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūṃs tejodhātāv adhimucya sarvam api tejodhātur evaikadhātur bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn vāyudhātāv adhimucya sarvam api vāyudhātur evaikadhātur bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn ākāśadhātāv adhimucya sarvam apy ākāśadhātur evaikadhātur bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn nīle dhimucya sarvam api nīlam eva bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn pīte 'dhimucya sarvam api pītam eva bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn lohite 'dhimucya sarvam api lohitam eva bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn avadāte 'dhimucya sarvam apy avadātam eva bhavati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvadhātūn vijñāne 'dhimucya sarvam api vijñānam evaikadhātur bhavati."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "pṛthivyaptejovāyvākāśanīlapītalohitāvadātavijñānaṃ sarvam apy ekam eva bhavatīty etāny ucyante kṛtsnāyatanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "nirantarakṛtsnaspharaṇād etāny ucyante kṛtsnāyatanāni. ekaikaṃ cāyatanaṃ sarvaṃ bhavati, tasmād ucyante kṛtsnāyatanānīti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_43] tatra katamā aṣṭādaśa śūnyatāḥ? yadutādhyātmaśūnyatā, bahirdhāśūnyatā, adhyātmabahirdhāśūnyatā, śūnyatāśūnyatā, mahāśūnyatā, paramārthaśūnyatā, saṃskṛtaśūnyatā, asaṃskṛtaśūnyatā, atyantaśūnyatā, anavarāgraśūnyatā, anavakāraśūnyatā, prakṛtiśūnyatā, sarvadharmaśūnyatā, svalakṣaṇaśūnyatā, anupalambhaśūnyatā, abhāvaśūnyatā, svabhāvaśūnyatā, abhāvasvabhāvaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamādhyātmaśūnyatā? ādhyātmikā dharmā ucyante, yaduta cakṣuḥ, śrotraṃ, ghrāṇaṃ, jihvā, kāyo, manaḥ. tatra cakṣuś cakṣuṣā śūnyam akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. evam eva śrotraṃ, ghrāṇaṃ, jihvā, kāyo, mano manasā śūnyam akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'dhyātmaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā bahirdhāśūnyatā? bāhyā dharmā ucyante yaduta rūpaṃ, śabdo, gandho, rasaḥ, spraṣṭavyaṃ, dharmāḥ. tatra rūpāṇi rūpaiḥ śūnyāny akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. evam eva śabdo, gandho, rasaḥ, spraṣṭavyaṃ, dharmā dharmaiḥ śūnyā akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate bahirdhāśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamādhyātmabahirdhāśūnyatā? adhyātmabāhyā dharmā ucyante ṣaḍ ādhyātmikāny āyatanāni, ṣaḍ bāhyāny āyatanāni. tatrādhyātmikā dharmā ādhyātmikair dharmaiḥ śūnyā akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. bāhyā dharmā bāhyair dharmaiḥ śūnyā akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'dhyātmabahirdhāśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā śūnyatāśūnyatā? yā sarvadharmaśūnyatā tayā sarvadharmaśūnyatayā sarvadharmaśūnyatā śūnyākūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā mahāśūnyatā? pūrvā dik pūrvayā diśā śūnyākūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. evam eva dakṣiṇā, paścimā, uttarā dik, catasro vidiśas, tā aṣṭau diśa, uparisṭāddig upariṣṭāddiśā śūnyā, adhastāddig adhastāddiśā śūnyākūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate mahāśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā paramārthaśūnyatā? paramārtha ucyate nirvāṇam. tatra nirvāṇaṃ nirvāṇena śūnyam akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate paramārthaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā saṃskṛtaśūnyatā? saṃskṛtam ucyate kāmadhātū, rūpadhātur, arūpadhātuḥ. tatra kāmadhātuḥ kāmadhātunā śūnyo 'kūṭasthāvināśitām upādāya. evam eva rūpadhātū rūpadhātunā śūnyo, 'rūpadhātur arūpadhātunā śūnyaḥ; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate saṃskṛtaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamāsaṃskṛtaśūnyatā? asaṃskṛtam ucyate yasya dharmasya notpādo, na sthitir, na nirodho, nānyathātvam. tatrāsaṃskṛtam asaṃskṛtena śūnyam akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'saṃskṛtaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamātyantaśūnyatā? yasya dharmasya notpāda upalabhyate 'kūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'tyantaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamānavarāgraśūnyatā? yasya dharmasya nāgatir upalabhyate 'kūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'navarāgraśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamānavakāraśūnyatā? yatra na kasyacid dharmasyāvakāro 'kūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'navakāraśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā prakṛtiśūnyatā? yā sarvadharmāṇāṃ prakṛtiḥ saṃskṛtānāṃ vāsaṃskṛtānāṃ vā sā na śrāvakaiḥ kṛtā, na pratyekabuddhaiḥ kṛtā, na bodhisattvaiḥ kṛtā, na buddhair bhagavadbhiḥ kṛtākūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate prakṛtiśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā svalakṣaṇaśūnyatā? tatra rūpyalakṣaṇaṃ rūpam, anubhavalakṣaṇā vedanā, saṃjānanalakṣaṇā saṃjñā, abhisaṃskāralakṣaṇāḥ saṃskārāḥ, vijānanalakṣaṇaṃ vijñānaṃ peyālaṃ yāvad yac ca saṃskṛtānāṃ dharmāṇāṃ lakṣaṇaṃ yac cāsaṃskṛtānāṃ dharmāṇāṃ lakṣaṇaṃ sarva ete dharmāḥ svena svena lakṣaṇena śūnyā akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate svalakṣaṇaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā sarvadharmaśūnyatā? sarvadharmā ucyante pañca skandhā, dvādaśāyatanāny, aṣṭādaśa dhātavo, rūpiṇo dharmā, arūpiṇo dharmāḥ, saṃskṛtā dharmā, asaṃskṛtā dharmāḥ. tatra sarvadharmāḥ sarvadharmaiḥ śūnyā akūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate sarvadharmaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamānupalambhaśūnyatā? sāpi sarvadharmānupalambho 'kūṭasthāvināśitām upādāya; tat kasmād dhetoḥ? prakṛtir asyaiṣā. iyam ucyate 'nupalambhaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamābhāvaśūnyatā? yatra na kaścid bhāva upalabhyata iyam ucyate 'bhāvaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamā svabhāvaśūnyatā? yaḥ sāṃyogikasya svabhāvābhāva iyam ucyate svabhāvaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamābhāvasvabhāvaśūnyatā? nāsti sāṃyogikasya kaścit svabhāvaḥ. iyam ucyate 'bhāvasvabhāvaśūnyatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "punar aparaṃ śāradvatīputra bhāvo bhāvena śūnyo, 'bhāvo 'bhāvena śūnyaḥ, svabhāvaḥ svabhāvena śūnyaḥ, parabhāvaḥ parabhāvena śūnyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "tatra katamo bhāvaḥ? bhāva ucyate pañca skandhā yaduta rūpaṃ, vedanā, saṃjñā, saṃskārā, vijñānam. tatra bhāvo bhāvena śūnyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "katham abhāvo 'bhāvena śūnyaḥ? abhāva ucyate 'saṃskṛtam. tatrāsaṃskṛtam asaṃskṛtena śūnyam, evam abhāvo 'bhāvena śūnyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "kathaṃ svabhāvaḥ svabhāvena śūnyaḥ? yā sarvadharmāṇāṃ śūnyatā sā na jñānena kṛtā na darśanena kṛtā na kenacit kṛtā. ayaṃ svabhāva ucyate svabhāvena śūnyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "kathaṃ parabhāvaḥ parabhāvena śūnyaḥ? yotpādād vā tathāgatānām anutpādād vā tathāgatānāṃ sthitaivaiṣā dharmāṇāṃ dharmasthititā, dharmadhātur, dharmānavadyatā, tathatāviparyāsatathatānanyatathatā, bhūtakoṭir yaś cemeṣāṃ pareṇa śūnyaḥ parabhāvaḥ sa ucyate parabhāvena śūnyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "ete śāradvatīputra te sarvadharmā yeṣv anabhiniviṣṭo bodhisattvo mahāsattvaḥ prajñāpāramitāyāṃ pāraṃ gataḥ kṣipram anuttarāṃ samyaksaṃbodhim abhisaṃbudhyate."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "daśasāhasrikāyāḥ prajñāpāramitāyā nidānaparivarto nāma prathamaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "daśasāhasrikā prajñāpāramitā, dvitīyo 'dhyāyaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_44] tato bhagavān āyuṣmantaṃ śāradvatīputram avocat: tatra katamāni śāradvatīputra tathāgatasya daśa balāni? yaduta"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sthānaṃ sthānato yathābhūtaṃ prajānāty asthānam asthānato yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "atītānāgatapratyutpannānāṃ karmaṇāṃ karmasamādānānāṃ ca sthānaśo hetuśo vipākaṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "anekadhātunānādhātulokaṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sa parasattvānāṃ parapudgalānāṃ nānādhimuktikatām anekādhimuktikatāṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "parasattvānāṃ parapudgalānām indriyaparāparatvaṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sarvatragāminīṃ pratipadaṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "indriyabalabodhyaṅgavimokṣadhyānasamādhisamāpattīnāṃ saṃkleśavyavadānavyutthānajñānaṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "anekavidhaṃ pūrvanivāsam anusmarati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "sattvānāṃ cyutyupapattiṃ yathābhūtaṃ prajānāti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "āsravāṇāṃ kṣayād anāsravāṃ cetovimuktiṃ prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣātkṛtyopasaṃpadya viharati: kṣīnā me jātir, uṣitaṃ brahmacaryaṃ, kṛtaṃ karaṇīyaṃ, nāparam asmād bhavaṃ prajānāmīti. imāni śāradvatīputra tathāgatasya daśa balāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_45] tatra katamāni śāradvatīputra catvāri vaiśāradyāni?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "samyaksaṃbuddhasya me pratijānata ime dharmā anabhisaṃbuddhā ity atra vata māṃ śramaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā kaścid vā punar loke saha dharmeṇa codayed iti nimittam etan na samanupaśyāmi, nimittam etad aham asamanupaśyan kṣemaprāpto viharāmy abhayaprāpto vaiśāradyaprāpto viharāmy, udāram ārṣabhaṃ sthānāṃ pratijānāmi, parṣadi samyak siṃhanādaṃ nadāmi, brāhmaṃ cakraṃ pravartayāmy apravartitapūrvaṃ śramaṇena vā brāhmaṇena vā devena vā māreṇa vā brahmaṇā vā kenacid vā loke saha dharmeṇeti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "kṣīṇāsravasya me pratijānata ima āsravā aparikṣīṇā ity atra vata māṃ śramaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā kaścid vā punar loke saha dharmeṇa codayed iti nimittam etan na samanupaśyāmi, nimittam etad aham asamanupaśyan kṣemaprāpto viharāmy abhayaprāpto vaiśāradyaprāpto viharāmy, udāram ārṣabhaṃ sthānaṃ pratijānāmi, parṣadi samyak siṃhanādaṃ nadāmi, brāhmaṃ cakraṃ pravartayāmy apravartitapūrvaṃ śramaṇena vā brāhmaṇena vā devena vā māreṇa vā brahmaṇā vā kenacid vā loke saha dharmeṇeti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "ye ca mayāntarāyikā dharmā ākhyātās te pratisevato nālam antarāyāyeti, nedaṃ sthānaṃ vidyata ity atra vata māṃ śramaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā kaścid vā punar loke saha dharmeṇa codayed iti nimittam etan na samanupaśyāmi, nimittam etad aham asamanupaśyan kṣemaprāpto viharāmy abhayaprāpto vaiśāradyaprāpto viharāmy, udāram ārṣabhaṃ sthānaṃ pratijānāmi, parṣadi samyak siṃhanādaṃ nadāmi, brāhmaṃ cakraṃ pravartayāmy apravartitapūrvaṃ śramaṇena va brāhmaṇena vā devena vā māreṇa vā brahmaṇā vā kenacid vā loke saha dharmeṇeti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "yā tena śrāvakebhyaḥ pratipad ākhyātāryanairyāṇikā nairvedhikā tatkarasya samyag duḥkhakṣayāya tāṃ pratipadyamāno na niryāyād samyag duḥkhakṣayāyeti, nedaṃ sthānaṃ vidyata ity atra vata māṃ śramaṇo va brāhmaṇo vā devo vā māro vā brahmā vā kaścid vā punar loke saha dharmeṇa codayed iti nimittam etan na samanupaśyāmi, nimittam etad aham asamanupaśyan kṣemaprāpto viharāmy abhayaprāpto vaiśāradyaprāpto viharāmy, udāram ārṣabhaṃ sthānaṃ pratijānāmi, parṣadi samyak siṃhanādaṃ nadāmi, brāhmaṃ cakraṃ pravartayāmy apravartitapūrvaṃ śramaṇena vā devena vā māreṇa vā brahmaṇā vā kenacid vā loke saha dharmeṇeti. etāny ucyante catvāri vaiśāradyāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_46] tatra katamāś catasraḥ pratisaṃvidaḥ? yaduta arthapratisaṃvid, dharmapratisaṃvin, niruktipratisaṃvit, pratibhānapratisaṃvit. etā ucyante catasraḥ pratisaṃvidaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_47] tatra katamā mahāmaitrī? yā tathāgatasya sarvasattveṣu śatrau ca mitre ca samavṛtiteyam ucyate mahāmaitrī."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_48] tatra katamā mahākarunā? niḥsattveṣu sattveṣu yo maitryatyāga iyam ucyate mahākaruṇā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_49] tatra katame 'ṣṭādaśāvenikā buddhadharmāḥ? yaduta"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "nāsti tathāgatasya skhalitaṃ; nāsti ravitaṃ; nāsti muṣitasmṛtitā; nāsti nānātvasaṃjñā; nāsty asamāhitacittam; nāsty apratisaṃkhyāyopekṣā; nāsti chandasya hānir; nāsti vīryasya hānir; nāsti smṛter hānir; nāsti samādher hānir; nāsti prajñāyā hānir; nāsti vimukter hānir nāsti vimuktijñānadarśanasya hāniḥ; sarvaṃ kāyakarma jñānapūrvaṃgamaṃ jñānānuparivarti; sarvaṃ vākkarma jñānapūrvaṃgamaṃ jñānānuparivarti; sarvaṃ manaḥkarma jñānapūrvaṃgamaṃ jñānānuparivarti; atīte 'dhvany asaṅgam apratihataṃ jñānadarśanaṃ pravartate; anāgate 'dhvany asaṅgam apratihataṃ jñānadarśanaṃ pravartate; pratyutpanne 'dhvany asaṅgam apratihataṃ jñānadarśanaṃ pravartate. ima ucyante 'ṣṭādaśāveṇikā buddhadharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_50] tatrā katamā sarvajñatā? yad dvādaśasu śrāvakapratyekabuddhāyataneṣv ekāntikaṃ pudgalanairātmyajñānam iyam ucyate sarvajñatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_51] tatra katamā mārgākārajñatā? yad bodhisattvasya triyānamārgajñasya śrāvakapratyekabuddhayānāsaṃtuṣṭasya bodhisattvayānena niṣkramaṇam iyam ucyate mārgākārajñatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_52] tatra katamā sarvākārajñatā? yat tathāgatasya sarvadharmāṇāṃ sarveṣu traikālikākāreṣv avicikitsitaṃ jñānam iyam ucyate sarvākārajñatā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_53] tatra katamaḥ ṣaṭ paramitāḥ? yaduta dānapāramitā, śīlapāramitā, kṣāntipāramitā, vīryapāramitā, dhyānapāramitā, prajñāpāramitā. imā ucyante ṣaṭ pāramitāh."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_54] tatra katamā ṣaḍ abhijñāḥ? yaduta"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "ṛddhividhijñānasākṣātkartavyajñānābhijñā; divyacakṣurjñānasākṣātkartavyajñānābhijñā; divyaśrotrajñānasākṣātkartavyajñānābhijñā; paracittajñānasākṣātkartavyajñānābhijñā; pūrvanivāsānusmṛtijñānasākṣātkartavyajñānābhijñā; āsravakṣayajñānasākṣātkartavyajñānābhijñā. imā ucyante ṣaḍ abhijñā."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_55] tatra katamāni pañca cakṣūṃṣi? yaduta māṃsacakṣur, divyacakṣuḥ, prajñācakṣur, dharmacakṣur, buddhacakṣuḥ. imāny ucyante pañca cakṣūṃṣi."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_56] tatra katamāni tathāgatasya dvātriṃśan mahāpuruṣalakṣaṇāni? yaduta"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān supratiṣṭhitapādaḥ. tatrāyaṃ supratiṣṭhitapādaḥ: sakalābhyāṃ pādatalābhyāṃ bhūmiṃ saṃspṛśati tadyathā karaṇḍatalaṃ samatalāvalambanāt susama ādhāre 'vasthāpitaṃ sakalenādhastalena bhūmiṃ saṃspṛśaty evam eva bhagavān supratiṣṭhitapādaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān samantanemikaḥ. tatrāyaṃ samantanemikah: adhastāt pādatalayoś cakre jāte sahasrāre sanabhike sanemike sarvākāraparipūrake;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān mṛdutaruṇahastapādaḥ. tatreyaṃ mṛdutaruṇahastapādatā: tadyathā śālmalikambalaṃ karpāsakambalaṃ vā, yādṛśam anyapuruṣāṇāṃ nāsti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān dīrghāṅguliḥ. tatreyaṃ dīrghāṅgulitā: tasya hastapādāṅgulayo 'tidīrghā, yādṛśam anyapuruṣāṇāṃ nāsti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān jalahastapādah: tasya hastapādayor jālāny avanaddhāni, yādṛśam anyapuruṣāṇāṃ nāsti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān āyatapārṣṇiḥ. tatrāyam āyatapārṣṇiḥ: tasya pādapāṛṣnitale āyate, yādṛśam anyapuruṣāṇāṃ nāsti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān ucchaṅkhapādaḥ. tatreyam ucchaṅkhapādatā: āyatapārṣṇyā saṃprayoga āyatapārṣṇer gulphasya ca sandhir adṛśyatvena saṃyujyate, yādṛśam anyapuruṣāṇāṃ nāsti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān aiṇeyajaṅghaḥ. tatrāyam aiṇeyajaṅghaḥ: tasya jaṅghe anupūrvatanuke bhūtvā samyag anupūrve bhavataḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān sthitānavanatājānupralambabāhuḥ. tatrāyaṃ sthitānavanatājānupralambabāhur: bhagavān sthitako 'navanatakāya ubhābhyāṃ pāṇitalābhyāṃ jānumaṇḍale parispṛśati saṃmṛśati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān kośagatavastiguhyaḥ. tatreyaṃ kośagatavastiguhyatā: tadyathā varagotra ājāneyo mahāhasty ājāneyo vāśvaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān pradakṣiṇāvartaikaikaromaḥ. tatreyaṃ pradakṣiṇāvartaikaikaromatā: tasyaikaikaromakūpebhya ekaikāni romāṇi jātāni nīlāni kuṇḍalāvartāni snigdhakomalāni;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān ūrdhvāgraromaḥ. tatreyam ūrdhvāgraromatā: tasya śiraḥkāye keśaromāṇi jātāny ūrdhvam ākuñcitāni nīlāni kuṇḍalāvartāni pradakṣiṇāvartāni;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān sūkṣmasnigdhakomalacchaviḥ. tatreyaṃ sukṣmasnigdhakomalacchavitā: tasya kaye rajojalaṃ nāvatiṣṭhati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān suvarṇavarṇaḥ. tadyathā nānāratnakhacito jāmbunadasuvarṇayūpa evaṃ surūpaḥ sudarśanas, tasmād ucyate suvarṇavarṇaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān saptotsadaḥ. tatreyaṃ saptotsadatā: tasya dvayoḥ padayor dvāv utsadau surūpau sudarśanau parivṛddhamāṃsalohitau; evam eva dvayor hastayor dvāv utsadau surūpau sudarśanau parivṛddhamāṃsalohitau, dvayor aṃsayor dvāv utsadau, kandharopari caika utsadaḥ surūpaḥ sudarśanaḥ parivṛddhamāṃsalohitaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān susaṃvṛttaskandhaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavaṃś citāntarāṃsaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān svṛjujātagātraḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān nyagrodhaparimaṇḍalaḥ. tatreyaṃ nyagrodhaparimaṇḍalatā: yāvān āyāmatas tāvān vistārato, yāvān vistāratas tāvān āyāmataḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān siṃhahanuḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavāṃś catvāriṃśaddantaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān aviraladantaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān śuklatīkṣṇonnatāgradantaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān rasāgravān. sa ṛjukaṇṭhanāḍiko 'jihmam asaṅgaṃ gilanasamartho 'sti;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān prabhūtatanujihvaḥ. tatreyam prabhūtatanujihvatā: mukhāj jihvāṃ nirṇamayyobhe nāsikāvivare ubhe cakṣurvivare ubhe karṇavivare spṛśati parimṛśati, keśaparyantaṃ sarvaṃ mukhamaṇḍalam ācchādayati;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān brahmasvaraḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān viśālagopakṣmanetraḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān abhinīlanetraḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān parisamāptanetrapiṇḍaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān vyāmaprabhaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān pūrṇacandranibhānanaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavato bhruvor antara ūrṇā jātā karpāsavat komalā kundapuṣpacandraśaṅkhapadmakesaragokṣīrāvaśyāyapuṣpasadṛśā;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "bhagavān uṣṇīsaśīrṣaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "etāny ucyante dvātriṃśan mahāpuruṣalakṣaṇāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_57] tatra katamāny aśītir anuvyañjanāni? yaduta:"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavanta ātāmranakhā, nārāyaṇavat susaṃhatagatrāś, cāruniṣpannajānumaṇḍalāḥ, śucigātrā, mṛdugātrāḥ, komalagātrāḥ, snigdhagātrā, ajihmagātrā, dīrghānupūrvāṅgulayaḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavanto vṛttāṅgulayo, 'nupūrvāṅgulayo, gūḍhaśirā, gūḍhagulphaḥ, surūpagātrāḥ, suvibhaktagātrāḥ, suviśuddhāyatanāḥ, suviśuddhajñānāḥ, sākṣātsaṃpanneryāpathāḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavantaḥ śrīmanto buddhimanto, darśanīyā, nātyāyatavadanā, ajihmavadanā, bimbavad raktoṣṭhāś, citavadanā, gambhīrasvarā, gambhīranābhayaḥ, suvṛttanābhayaḥ, pradakṣīṇavartanābhayaś, citapāṇipādāḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavanto yathepsitapāṇipādāḥ, samapāṇilatā, avyavahitapāṇilekhā, āyatapāṇilekhā, vyapagatamaladurgandhagātrā, bhāsvaravarṇāś, cārvāyatanamukhāś, candrasadṛśamukhāḥ, pūrvābhilāpino, 'pagatabhrūkuṭimukhāḥ; sarvaromakūpebhyo manāpo gandho nirgacchati; sugandhamukhā bhavanti, siṃhavikrāntagāmino, nāgavikrāntagāmino, haṃsavikrāntagāminaś, chattrākārottamāṅgā, madhurasarvākāraparisamāptaghoṣās, tīkṣṇadaṃṣṭrās, tuṅganāsā, raktajihvāḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavantas tanujihvā, abhinīlaromāḥ, śuciromā, viśālanetrāḥ, paripūrṇavivarā, lohitapāṇipādalatā, nābhinālarahitā, abhugnakukṣayaḥ, kṣāmodarāḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhā bhagavanto 'valitakukṣayaḥ, śubhasandhayaś, citasandhayaḥ, pariśuddhapāṇipādā, vyāmaprabhāḥ, prabhāsvaragāminaḥ, kāyadarśanatṛptadevamanuṣyāḥ, sarvaprāṇyavimānitadarśanāḥ, sattvānuśāsakās; teṣāṃ vāg anukūlavartiparṣado bahir na nirgacchati; siṃhapūrvārdhakāyā bhavanti, susaṃbaddhagātrā, gūḍhaśikhā, abhinīlaślakṣnacitakeśā, anākulakeśā, udvartitasukuñcitakeśā, asaṃlulitakeśāḥ, śrīvatsavibhūṣitoraskāḥ, śriyojjvalapāṇipādalakṣaṇāḥ;"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "buddhānāṃ bhagavatāṃ hiṅgulamanaḥśilācīnapiṣṭavaiḍūryatāmrakiṭṭavarṇair likhitānīva lakṣaṇāni. etany ucyante 'śītir anuvyañjanāni."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_58] tata āyuṣmān śāradvatīputro bhagavantam etad avocat: saced bhadanta bhagavan bodhisattvā mahāsattvāḥ sarvadharmeṣv anabhiniviṣṭās, tena bodhisattvāḥ sarvadharmān pṛthaṅ na samanupaśyanti yaduteme dharmāḥ kuśalā ime dharmā akuśalā, ime dharmā vyākṛtā ime dharmā avyākṛtā, ime dharmā laukikā ime dharmā lokottarā, ime dharmāḥ sāsravā ime dharmā anāsravā, ime dharmāḥ saṃskṛtā ime dharmā asaṃskṛtā, ime dharmāḥ sādhāraṇā ime dharmā asādhāraṇā ity, asaṃpaśyamānāś ca kathaṃ bodhimārgaṃ pratipadyante, 'pratipadyamānāś ca kathaṃ sarvajñatām anuprāpnuvanti?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "evam ukte bhagavān ayuṣmantaṃ śāradvatīputram etad avocat: yad api śāradvatīputra bodhisattvāḥ sarvadharmān pṛthak paśyanti tat saṃvṛtitaḥ, paramārthatas tu nāsti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "āha: kathaṃ bhagavan saṃvṛtitaḥ sat paramārthato nāsti?"
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_59] bhagavān avocat: yasmin kāle śāradvatīputra bodhisattva evaṃ cintayati: tatra katame kuśalā laukikā dharmā iti, sa evaṃ cintayati: ete kuśalā laukikā dharmā yaduta pitṛjñatā, mātṛjñatā, śramaṇyatā, brāhmaṇyatā, kulajyeṣṭhāpacāyitā, dānamayaṃ puṇyakriyāvastu, śīlamayaṃ puṇyakriyāvastu, bhāvanāmayaṃ puṇyakriyāvastu, vaiyāvṛtyasahagatam upāyakauśalyapuṇyaṃ, daśa kuśalakarmapathā, laukikā vidhmātakasaṃjñā, vipaḍumakasaṃjñā, vilohitakasaṃjñā, vipūyakasamjñā, vinīlakasaṃjñā, vikhāditakasaṃjñā, vikṣiptakasaṃjñā, asthikasaṃjñā, vidagdhakasaṃjñā; evam eva catvāri dhyānāni, catvāry apramāṇāni, catasra ārūpyasamāpattayo, buddhānusmṛtir, dharmānusmṛtiḥ, saṃghānusmṛtiḥ, śīlānusmṛtis, tyāgānusmṛtir, devatānusmṛtir, upaśamānusmṛtir, ānāpānānusmṛtiḥ, kāyagatānusmṛtir, maraṇānusmṛtir iti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_60] tatra katame 'kuśalā dharmā iti cintayitvā sa evaṃ cintayati: ete 'kuśalā dharmā yaduta prāṇātipāto, 'dattādānaṃ, kāmamithyācāro, mṛṣāvādaḥ, paiśunyaṃ, pāruṣyaṃ, saṃbhinnapralāpo, 'bhidhyā, vyāpādo, mithyādṛṣṭiḥ, krodha, upanāho, mrakṣaḥ, pradāso, vihiṃserṣyā, mātsaryaṃ, māna iti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_61] tatra katame 'vyākṛtā dharmā iti cintayitvā sa evaṃ cintayati: ete 'vyākṛtā dharmā yadutāvyākṛtāni kāyakarmāṇy, avyākṛtāni vākkarmāṇy, avyākṛtāni manaḥkarmāṇy, avyākṛtāni catvāri mahābhūtāny, avyākṛtāni pañcendriyāṇy, avyākṛtāḥ pañca skandhā, dvādaśāyatanāny, aṣṭādaśa dhātavo, vipākaś ceti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_62] tatra katame lokottarā dharmā iti cintayitvā sa evaṃ cintayati: ete lokottarā dharmā yaduta catvāri smṛtyupasthānāni, catvāri samyakprahāṇāni, catvāra ṛddhipādāḥ, pañcendriyāṇi, pañca balāni, sapta bodhyaṅgāny, āryāṣṭāṅgamārgas, trīṇi vimokṣamukhāny, anājñātamājñāsyāmīndriyam, ājñendriyam, ājñātāvīndriyaṃ, savitarkaḥ savicāraḥ samādhir, avitarko vicāramātraḥ samādhir, avitarko 'vicāraḥ samādhir, adhyātmaśūnyatā yāvad abhāvasvabhāvaśūnyatā, tathāgatasya daśa balāni, catvāri vaiśāradyāni, catasraḥ pratisaṃvido, mahāmaitrī, mahākaruṇā, aṣṭādaśāveṇikā buddhadharmā iti."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_63] tatra katame sāsravā dharmāḥ? traidhatukaparyāpannāḥ pañca skandhā, dvādaśāyatanāny, aṣṭādaśa dhātavaś, catvari dhyānāni, catvāry apramāṇāni, catasra ārūpyasamāpattaya ete ucyante sāsravā dharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_64] tatra katame 'nāsravā dharmāḥ? catvāri smṛtyupasthānāni peyālaṃ yāvad aṣṭādaśāveṇikā buddhadharmā ete 'nāsravā dharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_65] tatra katame saṃskṛtā dharmāḥ? yaduta kāmadhātū, rūpadhātur, arūpadhātur, evam eva pañca skandhāś, catvāri dhyānāni, catvāry apramāṇāni, catasra ārūpyasamāpattayaś, catvāri smṛtyupasthānāni peyālaṃ yāvad aṣṭādaśāveṇikā buddhadharmā, ete saṃskṛtā dharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_66] tatra katame 'saṃskṛtā dharmāḥ? yeṣāṃ dharmāṇāṃ notpādo, na sthitir, na nirodho, nānyathātvam, evam eva rāgakṣayo, dveṣakṣayo, mohakṣaya, evam eva dharmasthitir, dharmatā, dharmadhātur, dharmānavadyatā, tathatābhrāntatathatānanyatathatā, bhūtakoṭir eta ucyante 'saṃskṛtā dharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_67] tatra katame sādhāraṇā dharmāḥ? yaduta catvāri dhyānāni, catvāry apramāṇāni, catasra ārūpyasamāpattayaḥ, pañcābhijñā, ete pṛthagjanaiḥ saha sādhāraṇā dharmaḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_68] tatra katame pṛthagjanaiḥ sahāsādhāraṇā dharmāḥ? saptatriṃśad bodhipakṣikā dharmā, daśa balāni, catvāri vaiśāradyāni, catasraḥ pratisaṃvidas, trīṇi vimokṣamukhāni yāvad aṣṭādaśāveṇikā buddhadharmā eta ucyante 'sādhāraṇā dharmāḥ."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "[DsP_69] yad api śāradvatīputra bodhisattvāḥ saṃvṛtitaḥ sarvadharmān evaṃ pṛthak paśyamānāḥ paramārthato nābhiniviśanti, katham anabhiniviṣṭāḥ? tadyathā śāradvatīputra kaścit puruṣo māyānirmitāṃ caturaṅginīṃ senāṃ dṛṣṭvā, yaduta hastikāyam aśvakāyaṃ rathakāyaṃ pattikāyaṃ, tatra senāstīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣo gharmārto nānāvidhāṃ marīcikām ūrmivac calantīṃ dṛṣṭvedaṃ jalam iti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣaḥ svapne nānāvidhāni rūpāṇi dṛṣṭvā vibuddhaḥ san teṣām rūpam astīti nābhiniviśaty, evam eva śaradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣa udake candraṃ dṛṣṭvā tatra candro 'stīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣa indrajālaṃ dṛṣṭvā tatra vastutve nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api sarvadharmāṇāṃ vastutve nābhiniviśanti; tadyathā śāradvatīputra kaścit pūruṣo māyayākāśe carann api tatrākāśo 'stīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣaḥ pratiśrutkāṃ śrutvā tatra śabdo 'stīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvā sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣo gandharvanagaraṃ dṛṣṭvā tatra nagaram astīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti; tadyathā śāradvatīputra kaścit puruṣa ādarśe mukhapratibimbaṃ dṛṣṭvaitan mukham astīti nābhiniviśaty, evam eva śāradvatīputra bodhisattvā mahāsattvāḥ sarvadharmān pṛthak paśyamānā api nābhiniviśanti, dharmeṣv anabhiniviṣṭāḥ prajñāpāramitāyāṃ pāraṃ gatāḥ kṣipram anuttarāṃ samyaksaṃbodhim abhisaṃbudhyante."
    },
    {
      "tag": "p",
      "attributes": {},
      "text": "daśasāhasrikāyāḥ prajñāpāramitāyāḥ sarvadharmaparivarto nāma dvitīyaḥ."
    }
  ]
}